In [2]:
%load_ext sql
import os
import pandas as pd
import numpy as np
from datetime import datetime, date
from dateutil.relativedelta import relativedelta
import math
import psycopg2
from sqlalchemy import create_engine
from sklearn import preprocessing
from sklearn.model_selection import train_test_split
from imblearn.under_sampling import RandomUnderSampler

pgconfig = {
    'host': 'localhost',
    'port': 5434,
    'database': 'dsdojo_db',
    'user': 'padawan',
    'password': 'padawan12345',
}
dsl = 'postgresql://{user}:{password}@{host}:{port}/{database}'.format(**pgconfig)

# pd.read_sql用のコネクタ
conn = psycopg2.connect(**pgconfig)
# pd.to_sql用のcreate engine
engine = create_engine(dsl)
# MagicコマンドでSQLを書くための設定
%sql $dsl

df_customer = pd.read_sql(sql='select * from customer', con=conn)
df_category = pd.read_sql(sql='select * from category', con=conn)
df_product = pd.read_sql(sql='select * from product', con=conn)
df_receipt = pd.read_sql(sql='select * from receipt', con=conn)
df_store = pd.read_sql(sql='select * from store', con=conn)
df_geocode = pd.read_sql(sql='select * from geocode', con=conn)

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## limit -> head

In [5]:
%%sql
select *
from receipt
limit 5

 * postgresql://padawan:***@localhost:5434/dsdojo_db
5 rows affected.

[(20181103, 1541203200, 'S14006', 112, 1, 'CS006214000001', 'P070305012', 1, 158),
 (20181118, 1542499200, 'S13008', 1132, 2, 'CS008415000097', 'P070701017', 1, 81),
 (20170712, 1499817600, 'S14028', 1102, 1, 'CS028414000014', 'P060101005', 1, 170),
 (20190205, 1549324800, 'S14042', 1132, 1, 'ZZ000000000000', 'P050301001', 1, 25),
 (20180821, 1534809600, 'S14025', 1102, 2, 'CS025415000050', 'P060102007', 1, 90)]

In [6]:
df_receipt.head(5)

,sales_ymd,sales_epoch,store_cd,receipt_no,receipt_sub_no,customer_id,product_cd,quantity,amount
0,20181103,1541203200,S14006,112,1,CS006214000001,P070305012,1,158
1,20181118,1542499200,S13008,1132,2,CS008415000097,P070701017,1,81
2,20170712,1499817600,S14028,1102,1,CS028414000014,P060101005,1,170
3,20190205,1549324800,S14042,1132,1,ZZ000000000000,P050301001,1,25
4,20180821,1534809600,S14025,1102,2,CS025415000050,P060102007,1,90

 ## order by -> sort_values

In [7]:
%%sql
select *
from receipt
order by receipt_no
limit 5

 * postgresql://padawan:***@localhost:5434/dsdojo_db
5 rows affected.

[(20170829, 1503964800, 'S12029', 112, 1, 'ZZ000000000000', 'P071001042', 1, 102),
 (20190718, 1563408000, 'S14011', 112, 1, 'CS011115000004', 'P060805001', 1, 495),
 (20181103, 1541203200, 'S14006', 112, 1, 'CS006214000001', 'P070305012', 1, 158),
 (20190326, 1553558400, 'S13016', 112, 1, 'CS016215000032', 'P091401190', 1, 780),
 (20181116, 1542326400, 'S14006', 112, 2, 'ZZ000000000000', 'P080401001', 1, 48)]

In [8]:
df_receipt.sort_values(by='receipt_no').head(5)

,sales_ymd,sales_epoch,store_cd,receipt_no,receipt_sub_no,customer_id,product_cd,quantity,amount
0,20181103,1541203200,S14006,112,1,CS006214000001,P070305012,1,158
54434,20170727,1501113600,S13035,112,2,ZZ000000000000,P080202029,1,118
54433,20180424,1524528000,S13038,112,2,CS038215000032,P070203001,1,88
9866,20190429,1556496000,S14040,112,2,CS040214000008,P071401009,1,1200
9869,20180718,1531872000,S13032,112,1,CS032214000014,P070805014,1,295

In [9]:
df_receipt.sort_values(by='receipt_no', ascending=False).head()

,sales_ymd,sales_epoch,store_cd,receipt_no,receipt_sub_no,customer_id,product_cd,quantity,amount
50963,20180228,1519776000,S14040,1664,1,ZZ000000000000,P060701005,1,130
95752,20180228,1519776000,S14036,1652,2,ZZ000000000000,P090103021,1,210
96988,20180228,1519776000,S14034,1640,1,CS034605000004,P050303009,1,138
75156,20180228,1519776000,S14034,1640,2,CS034605000004,P071002032,1,102
91382,20180228,1519776000,S14033,1629,1,ZZ000000000000,P070709010,1,138

In [21]:
%%sql
select *
from receipt
order by customer_id, amount
limit 5

 * postgresql://padawan:***@localhost:5434/dsdojo_db
5 rows affected.

[(20190308, 1552003200, 'S13001', 112, 1, 'CS001113000004', 'P071001012', 1, 98),
 (20190308, 1552003200, 'S13001', 112, 2, 'CS001113000004', 'P071401009', 1, 1200),
 (20190731, 1564531200, 'S13001', 112, 2, 'CS001114000005', 'P050101001', 1, 40),
 (20180503, 1525305600, 'S13001', 112, 2, 'CS001114000005', 'P080803001', 1, 100),
 (20190731, 1564531200, 'S13001', 112, 1, 'CS001114000005', 'P070301002', 1, 148)]

In [22]:
df_receipt.sort_values(by=['customer_id', 'amount']).head()

,sales_ymd,sales_epoch,store_cd,receipt_no,receipt_sub_no,customer_id,product_cd,quantity,amount
31349,20190308,1552003200,S13001,112,1,CS001113000004,P071001012,1,98
35811,20190308,1552003200,S13001,112,2,CS001113000004,P071401009,1,1200
46293,20190731,1564531200,S13001,112,2,CS001114000005,P050101001,1,40
2818,20180503,1525305600,S13001,112,2,CS001114000005,P080803001,1,100
91976,20190731,1564531200,S13001,112,1,CS001114000005,P070301002,1,148

In [23]:
%%sql
select *
from receipt
order by customer_id desc, amount
limit 5

 * postgresql://padawan:***@localhost:5434/dsdojo_db
5 rows affected.

[(20180912, 1536710400, 'S13018', 1102, 2, 'ZZ000000000000', 'P080102002', 1, 10),
 (20180228, 1519776000, 'S13005', 1172, 1, 'ZZ000000000000', 'P080102007', 1, 10),
 (20180708, 1531008000, 'S14042', 1122, 2, 'ZZ000000000000', 'P080102009', 1, 10),
 (20170609, 1496966400, 'S14033', 1172, 1, 'ZZ000000000000', 'P080102001', 1, 10),
 (20171211, 1512950400, 'S13039', 1172, 1, 'ZZ000000000000', 'P080102009', 1, 10)]

In [24]:
df_receipt.sort_values(by=['customer_id', 'amount'], ascending=[False, True]).head()

,sales_ymd,sales_epoch,store_cd,receipt_no,receipt_sub_no,customer_id,product_cd,quantity,amount
2640,20180708,1531008000,S14042,1122,2,ZZ000000000000,P080102009,1,10
3756,20170609,1496966400,S14033,1172,1,ZZ000000000000,P080102001,1,10
7627,20180912,1536710400,S13018,1102,2,ZZ000000000000,P080102002,1,10
9559,20180228,1519776000,S13005,1172,1,ZZ000000000000,P080102007,1,10
9973,20171211,1512950400,S13039,1172,1,ZZ000000000000,P080102009,1,10

## where -> []

In [25]:
%%sql
select *
from receipt
where amount = 10
limit 5

 * postgresql://padawan:***@localhost:5434/dsdojo_db
5 rows affected.

[(20171010, 1507593600, 'S13017', 1172, 2, 'CS017415000158', 'P080102003', 1, 10),
 (20180409, 1523232000, 'S14026', 1192, 2, 'CS026414000060', 'P080102001', 1, 10),
 (20180622, 1529625600, 'S14027', 1132, 2, 'CS027513000078', 'P080102003', 1, 10),
 (20180708, 1531008000, 'S14042', 1122, 2, 'ZZ000000000000', 'P080102009', 1, 10),
 (20170609, 1496966400, 'S14033', 1172, 1, 'ZZ000000000000', 'P080102001', 1, 10)]

In [26]:
df_receipt[df_receipt.amount == 10].head()

,sales_ymd,sales_epoch,store_cd,receipt_no,receipt_sub_no,customer_id,product_cd,quantity,amount
127,20171010,1507593600,S13017,1172,2,CS017415000158,P080102003,1,10
1857,20180409,1523232000,S14026,1192,2,CS026414000060,P080102001,1,10
2592,20180622,1529625600,S14027,1132,2,CS027513000078,P080102003,1,10
2640,20180708,1531008000,S14042,1122,2,ZZ000000000000,P080102009,1,10
3756,20170609,1496966400,S14033,1172,1,ZZ000000000000,P080102001,1,10

In [27]:
df_receipt.query('amount == 10').head()

,sales_ymd,sales_epoch,store_cd,receipt_no,receipt_sub_no,customer_id,product_cd,quantity,amount
127,20171010,1507593600,S13017,1172,2,CS017415000158,P080102003,1,10
1857,20180409,1523232000,S14026,1192,2,CS026414000060,P080102001,1,10
2592,20180622,1529625600,S14027,1132,2,CS027513000078,P080102003,1,10
2640,20180708,1531008000,S14042,1122,2,ZZ000000000000,P080102009,1,10
3756,20170609,1496966400,S14033,1172,1,ZZ000000000000,P080102001,1,10

In [28]:
%%sql
select *
from receipt
where product_cd in ('P080102003', 'P080102001')
limit 5

 * postgresql://padawan:***@localhost:5434/dsdojo_db
5 rows affected.

[(20171010, 1507593600, 'S13017', 1172, 2, 'CS017415000158', 'P080102003', 1, 10),
 (20180409, 1523232000, 'S14026', 1192, 2, 'CS026414000060', 'P080102001', 1, 10),
 (20180622, 1529625600, 'S14027', 1132, 2, 'CS027513000078', 'P080102003', 1, 10),
 (20170609, 1496966400, 'S14033', 1172, 1, 'ZZ000000000000', 'P080102001', 1, 10),
 (20190817, 1566000000, 'S14027', 1142, 1, 'CS027414000084', 'P080102001', 1, 10)]

In [31]:
df_receipt[df_receipt.product_cd.isin(['P080102003', 'P080102001'])].head()

,sales_ymd,sales_epoch,store_cd,receipt_no,receipt_sub_no,customer_id,product_cd,quantity,amount
127,20171010,1507593600,S13017,1172,2,CS017415000158,P080102003,1,10
1857,20180409,1523232000,S14026,1192,2,CS026414000060,P080102001,1,10
2592,20180622,1529625600,S14027,1132,2,CS027513000078,P080102003,1,10
3756,20170609,1496966400,S14033,1172,1,ZZ000000000000,P080102001,1,10
7133,20190817,1566000000,S14027,1142,1,CS027414000084,P080102001,1,10

In [32]:
df_receipt.query('product_cd in ("P080102003", "P080102001")').head()

,sales_ymd,sales_epoch,store_cd,receipt_no,receipt_sub_no,customer_id,product_cd,quantity,amount
127,20171010,1507593600,S13017,1172,2,CS017415000158,P080102003,1,10
1857,20180409,1523232000,S14026,1192,2,CS026414000060,P080102001,1,10
2592,20180622,1529625600,S14027,1132,2,CS027513000078,P080102003,1,10
3756,20170609,1496966400,S14033,1172,1,ZZ000000000000,P080102001,1,10
7133,20190817,1566000000,S14027,1142,1,CS027414000084,P080102001,1,10

In [33]:
%%sql
select *
from receipt
where amount >= 100
    and customer_id = 'CS017415000158'
limit 5

 * postgresql://padawan:***@localhost:5434/dsdojo_db
5 rows affected.

[(20170427, 1493251200, 'S13017', 1122, 1, 'CS017415000158', 'P050406042', 1, 248),
 (20180222, 1519257600, 'S13017', 1142, 2, 'CS017415000158', 'P080301003', 1, 135),
 (20190911, 1568160000, 'S13017', 1152, 2, 'CS017415000158', 'P070202011', 1, 141),
 (20190526, 1558828800, 'S13017', 1182, 1, 'CS017415000158', 'P060303001', 1, 148),
 (20170116, 1484524800, 'S13017', 1142, 2, 'CS017415000158', 'P070302011', 1, 328)]

In [35]:
df_receipt[(df_receipt.amount >= 100)&(df_receipt.customer_id == 'CS017415000158')].head()

,sales_ymd,sales_epoch,store_cd,receipt_no,receipt_sub_no,customer_id,product_cd,quantity,amount
4674,20170427,1493251200,S13017,1122,1,CS017415000158,P050406042,1,248
15182,20180222,1519257600,S13017,1142,2,CS017415000158,P080301003,1,135
20347,20190911,1568160000,S13017,1152,2,CS017415000158,P070202011,1,141
20920,20190526,1558828800,S13017,1182,1,CS017415000158,P060303001,1,148
22658,20170116,1484524800,S13017,1142,2,CS017415000158,P070302011,1,328

In [36]:
df_receipt.query('amount >= 100 and customer_id == "CS017415000158"').head()

,sales_ymd,sales_epoch,store_cd,receipt_no,receipt_sub_no,customer_id,product_cd,quantity,amount
4674,20170427,1493251200,S13017,1122,1,CS017415000158,P050406042,1,248
15182,20180222,1519257600,S13017,1142,2,CS017415000158,P080301003,1,135
20347,20190911,1568160000,S13017,1152,2,CS017415000158,P070202011,1,141
20920,20190526,1558828800,S13017,1182,1,CS017415000158,P060303001,1,148
22658,20170116,1484524800,S13017,1142,2,CS017415000158,P070302011,1,328

## 集計関数 -> agg

In [37]:
%%sql
select
    sum(quantity),
    avg(amount),
    max(amount),
    min(amount),
    count(customer_id),
    count(distinct(customer_id))
from receipt

 * postgresql://padawan:***@localhost:5434/dsdojo_db
1 rows affected.

[(105862, Decimal('320.5600825364679359'), 10925, 10, 104681, 8307)]

In [39]:
df_receipt.agg({
    'quantity': 'sum',
    'amount': ['mean', 'max', 'min'],
    'customer_id': ['count', 'nunique']
})

         quantity        amount  customer_id
count         NaN           NaN     104681.0
max           NaN  10925.000000          NaN
mean          NaN    320.560083          NaN
min           NaN     10.000000          NaN
nunique       NaN           NaN       8307.0
sum      105862.0           NaN          NaN

In [43]:
%%sql
select distinct(customer_id)
from receipt
limit 5

 * postgresql://padawan:***@localhost:5434/dsdojo_db
5 rows affected.

[('CS001311000059',),
 ('CS004614000122',),
 ('CS003512000043',),
 ('CS011615000061',),
 ('CS029212000033',)]

In [44]:
df_receipt.agg({'customer_id': 'unique'}).head()

      customer_id
0  CS006214000001
1  CS008415000097
2  CS028414000014
3  ZZ000000000000
4  CS025415000050

In [47]:
df_receipt.customer_id.unique()[0:5]

array(['CS006214000001', 'CS008415000097', 'CS028414000014',
       'ZZ000000000000', 'CS025415000050'], dtype=object)

## group by -> groupby

In [48]:
%%sql
select
    store_cd,
    count(distinct(customer_id))
from receipt
group by store_cd
limit 5

 * postgresql://padawan:***@localhost:5434/dsdojo_db
5 rows affected.

[('S12007', 147),
 ('S12013', 187),
 ('S12014', 193),
 ('S12029', 209),
 ('S12030', 199)]

In [51]:
df_receipt.groupby(by='store_cd', as_index=False).agg({'customer_id': 'nunique'}).head()

  store_cd  customer_id
0   S12007          147
1   S12013          187
2   S12014          193
3   S12029          209
4   S12030          199

In [58]:
%%sql
select
    store_cd,
    customer_id,
    sum(amount)
from receipt
group by store_cd, customer_id
order by store_cd, customer_id
limit 5

 * postgresql://padawan:***@localhost:5434/dsdojo_db
5 rows affected.

[('S12007', 'CS007113000004', 1107),
 ('S12007', 'CS007114000002', 4968),
 ('S12007', 'CS007115000006', 11528),
 ('S12007', 'CS007214000007', 2952),
 ('S12007', 'CS007214000013', 3530)]

In [60]:
df_receipt.groupby(by=['store_cd', 'customer_id'], as_index=False)\
        .agg({'amount': 'sum'})\
        .sort_values(by=['store_cd', 'customer_id'])\
        .head()

  store_cd     customer_id  amount
0   S12007  CS007113000004    1107
1   S12007  CS007114000002    4968
2   S12007  CS007115000006   11528
3   S12007  CS007214000007    2952
4   S12007  CS007214000013    3530

## join -> merge

In [64]:
%%sql
select *
from receipt as re
left join store as st
on re.store_cd = st.store_cd
limit 5

 * postgresql://padawan:***@localhost:5434/dsdojo_db
5 rows affected.

[(20181103, 1541203200, 'S14006', 112, 1, 'CS006214000001', 'P070305012', 1, 158, 'S14006', '葛が谷店', '14', '神奈川県', '神奈川県横浜市都筑区葛が谷', 'カナガワケンヨコハマシツヅキククズガヤ', '045-123-4031', Decimal('139.5633'), Decimal('35.53573'), Decimal('1886.0')),
 (20181118, 1542499200, 'S13008', 1132, 2, 'CS008415000097', 'P070701017', 1, 81, 'S13008', '成城店', '13', '東京都', '東京都世田谷区成城三丁目', 'トウキョウトセタガヤクセイジョウサンチョウメ', '03-0123-4012', Decimal('139.5966'), Decimal('35.63614'), Decimal('883.0')),
 (20170712, 1499817600, 'S14028', 1102, 1, 'CS028414000014', 'P060101005', 1, 170, 'S14028', '二ツ橋店', '14', '神奈川県', '神奈川県横浜市瀬谷区二ツ橋町', 'カナガワケンヨコハマシセヤクフタツバシチョウ', '045-123-4042', Decimal('139.4963'), Decimal('35.46304'), Decimal('1574.0')),
 (20190205, 1549324800, 'S14042', 1132, 1, 'ZZ000000000000', 'P050301001', 1, 25, 'S14042', '新山下店', '14', '神奈川県', '神奈川県横浜市中区新山下二丁目', 'カナガワケンヨコハマシナカクシンヤマシタニチョウメ', '045-123-4047', Decimal('139.6593'), Decimal('35.43894'), Decimal('1044.0')),
 (20180821, 1534809600, 'S14025', 1102, 2, 'CS025415000050', 'P060102007', 1, 90, 'S14025', '大和店', '14', '神奈川県', '神奈川県大和市下和田', 'カナガワケンヤマトシシモワダ', '046-123-4039', Decimal('139.468'), Decimal('35.43414'), Decimal('1011.0'))]

In [65]:
pd.merge(df_receipt, df_store, on='store_cd', how='left').head()

,sales_ymd,sales_epoch,store_cd,receipt_no,receipt_sub_no,customer_id,product_cd,quantity,amount,store_name,prefecture_cd,prefecture,address,address_kana,tel_no,longitude,latitude,floor_area
0,20181103,1541203200,S14006,112,1,CS006214000001,P070305012,1,158,葛が谷店,14,神奈川県,神奈川県横浜市都筑区葛が谷,カナガワケンヨコハマシツヅキククズガヤ,045-123-4031,139.5633,35.53573,1886.0
1,20181118,1542499200,S13008,1132,2,CS008415000097,P070701017,1,81,成城店,13,東京都,東京都世田谷区成城三丁目,トウキョウトセタガヤクセイジョウサンチョウメ,03-0123-4012,139.5966,35.63614,883.0
2,20170712,1499817600,S14028,1102,1,CS028414000014,P060101005,1,170,二ツ橋店,14,神奈川県,神奈川県横浜市瀬谷区二ツ橋町,カナガワケンヨコハマシセヤクフタツバシチョウ,045-123-4042,139.4963,35.46304,1574.0
3,20190205,1549324800,S14042,1132,1,ZZ000000000000,P050301001,1,25,新山下店,14,神奈川県,神奈川県横浜市中区新山下二丁目,カナガワケンヨコハマシナカクシンヤマシタニチョウメ,045-123-4047,139.6593,35.43894,1044.0
4,20180821,1534809600,S14025,1102,2,CS025415000050,P060102007,1,90,大和店,14,神奈川県,神奈川県大和市下和田,カナガワケンヤマトシシモワダ,046-123-4039,139.4680,35.43414,1011.0

## update -> loc[]

In [68]:
%%sql
select *
from category
limit 5

 * postgresql://padawan:***@localhost:5434/dsdojo_db
5 rows affected.

[('04', '惣菜', '0401', '御飯類', '040101', '弁当類'),
 ('04', '惣菜', '0401', '御飯類', '040102', '寿司類'),
 ('04', '惣菜', '0402', '佃煮類', '040201', '魚介佃煮類'),
 ('04', '惣菜', '0402', '佃煮類', '040202', '海草佃煮類'),
 ('04', '惣菜', '0402', '佃煮類', '040203', '野菜佃煮類')]

In [69]:
%%sql
update category
set category_major_name = '惣菜2'
where category_major_cd = '04'

 * postgresql://padawan:***@localhost:5434/dsdojo_db
22 rows affected.

[]

In [70]:
%%sql
select distinct(category_major_name)
from category
where category_major_cd = '04'
limit 5

 * postgresql://padawan:***@localhost:5434/dsdojo_db
1 rows affected.

[('惣菜2',)]

In [71]:
df_category[df_category.category_major_cd == '04'].category_major_name.unique()

array(['惣菜'], dtype=object)

In [72]:
df_category.loc[df_category.category_major_cd=='04', 'category_major_name'] = '惣菜2'

In [73]:
df_category[df_category.category_major_cd == '04'].category_major_name.unique()

array(['惣菜2'], dtype=object)

In [76]:
df_category.category_small_cd.nunique()

228

## delete -> []

In [78]:
df_category.iloc[0]

category_major_cd           04
category_major_name        惣菜2
category_medium_cd        0401
category_medium_name       御飯類
category_small_cd       040101
category_small_name        弁当類
Name: 0, dtype: object

In [79]:
%%sql
select *
from category
where category_small_cd = '040101'

 * postgresql://padawan:***@localhost:5434/dsdojo_db
1 rows affected.

[('04', '惣菜2', '0401', '御飯類', '040101', '弁当類')]

In [81]:
%%sql
delete
from category
where category_small_cd = '040101'

 * postgresql://padawan:***@localhost:5434/dsdojo_db
0 rows affected.

[]

In [82]:
%%sql
select *
from category
where category_small_cd = '040101'

 * postgresql://padawan:***@localhost:5434/dsdojo_db
0 rows affected.

[]

In [83]:
df_category = df_category[df_category.category_small_cd != '040101']

In [84]:
df_category.query('category_small_cd == "040101"')

Empty DataFrame
Columns: [category_major_cd, category_major_name, category_medium_cd, category_medium_name, category_small_cd, category_small_name]
Index: []

## insert -> append

In [87]:
%%sql
insert into
category(
    category_major_cd,
    category_major_name,
    category_medium_cd,
    category_medium_name,
    category_small_cd,
    category_small_name
)
values(
    '04',
    '惣菜2',
    '0401',
    '御飯類',
    '040101',
    '弁当類'
)

 * postgresql://padawan:***@localhost:5434/dsdojo_db
1 rows affected.

[]

In [88]:
%%sql
select *
from category
where category_small_cd = '040101'

 * postgresql://padawan:***@localhost:5434/dsdojo_db
1 rows affected.

[('04', '惣菜2', '0401', '御飯類', '040101', '弁当類')]

In [103]:
row = pd.DataFrame([{
    'category_major_cd': '04',
    'category_major_name': '惣菜2',
    'category_medium_cd': '0401',
    'category_medium_name': '御飯類',
    'category_small_cd': '040101',
    'category_small_name': '弁当類'
}])
df_category.append(row, ignore_index=True)

,category_major_cd,category_major_name,category_medium_cd,category_medium_name,category_small_cd,category_small_name
0,04,惣菜2,0401,御飯類,040102,寿司類
1,04,惣菜2,0402,佃煮類,040201,魚介佃煮類
2,04,惣菜2,0402,佃煮類,040202,海草佃煮類
3,04,惣菜2,0402,佃煮類,040203,野菜佃煮類
4,04,惣菜2,0402,佃煮類,040204,豆佃煮類
...,...,...,...,...,...,...
223,09,洗剤,0914,ペットフード,091402,ペット用剤
224,09,洗剤,0914,ペットフード,091403,ペット用具
225,09,洗剤,0915,ＤＩＹ用品,091501,建築・塗装材料
226,09,洗剤,0915,ＤＩＹ用品,091503,園芸用品
227,04,惣菜2,0401,御飯類,040101,弁当類

In [104]:
row = pd.DataFrame([{
    'category_major_cd': '04',
    'category_major_name': '惣菜2',
    'category_medium_cd': '0401',
    'category_medium_name': '御飯類',
    'category_small_cd': '040101',
    'category_small_name': '弁当類'
}])
df_category = df_category.append(row, ignore_index=True)
df_category.tail()

,category_major_cd,category_major_name,category_medium_cd,category_medium_name,category_small_cd,category_small_name
223,09,洗剤,0914,ペットフード,091402,ペット用剤
224,09,洗剤,0914,ペットフード,091403,ペット用具
225,09,洗剤,0915,ＤＩＹ用品,091501,建築・塗装材料
226,09,洗剤,0915,ＤＩＹ用品,091503,園芸用品
227,04,惣菜2,0401,御飯類,040101,弁当類

## columnsの別名 -> rename

In [105]:
%%sql
select sales_ymd as sales_date
from receipt
limit 5

 * postgresql://padawan:***@localhost:5434/dsdojo_db
5 rows affected.

[(20181103,), (20181118,), (20170712,), (20190205,), (20180821,)]

In [107]:
df_receipt.rename(columns={'sales_ymd': 'sales_date'}).head()

,sales_date,sales_epoch,store_cd,receipt_no,receipt_sub_no,customer_id,product_cd,quantity,amount
0,20181103,1541203200,S14006,112,1,CS006214000001,P070305012,1,158
1,20181118,1542499200,S13008,1132,2,CS008415000097,P070701017,1,81
2,20170712,1499817600,S14028,1102,1,CS028414000014,P060101005,1,170
3,20190205,1549324800,S14042,1132,1,ZZ000000000000,P050301001,1,25
4,20180821,1534809600,S14025,1102,2,CS025415000050,P060102007,1,90